# 0-9
label_dict = {str(i): str(i) for i in range(10)}  
    
# A01-A44 → ก - ฮ
exclude_chars = ['ฤ', 'ฦ']
# for i in range(1, 45):
#     key = f"A{str(i).zfill(2)}"
#     label_dict[key] = chr(ord('ก') + i - 1)
exclude_chars = ['ฤ', 'ฦ']
i = 1
a_index = 1
while a_index <= 44:
    char = chr(ord('ก') + i - 1)
    
    if char in exclude_chars:
        i += 1
        continue
    key = f"A{str(a_index).zfill(2)}"
    label_dict[key] = char
    i += 1
    a_index += 1
# print("add A:", label_dict)
    
# province codes
province_map = {
    "KBI": "กระบี่", "KRI": "กาญจนบุรี", "KSN": "กาฬสินธุ์", "KPT": "กำแพงเพชร", "KKN": "ขอนแก่น",
    "CTI": "จันทบุรี", "CCO": "ฉะเชิงเทรา", "CBI": "ชลบุรี", "CNT": "ชัยนาท", "CPM": "ชัยภูมิ",
    "CPN": "ชุมพร", "CRI": "เชียงราย", "CMI": "เชียงใหม่", "TRG": "ตรัง", "TRT": "ตราด",
    "TAK": "ตาก", "NYK": "นครนายก", "NPT": "นครปฐม", "NPM": "นครพนม", "NMA": "นครราชสีมา",
    "NRT": "นครศรีธรรมราช", "NSN": "นครสวรรค์", "NBI": "นนทบุรี", "NWT": "นราธิวาส", "NAN": "น่าน",
    "BKN": "บึงกาฬ", "BRM": "บุรีรัมย์", "PTE": "ปทุมธานี", "PKN": "ประจวบคีรีขันธ์", "PRI": "ปราจีนบุรี",
    "PTN": "ปัตตานี", "PYO": "พะเยา", "AYA": "พระนครศรีอยุธยา", "PNA": "พังงา", "PLG": "พัทลุง",
    "PCT": "พิจิตร", "PLK": "พิษณุโลก", "PBI": "เพชรบุรี", "PNB": "เพชรบูรณ์", "PRE": "แพร่",
    "PKT": "ภูเก็ต", "MKM": "มหาสารคาม", "MDH": "มุกดาหาร", "MSN": "แม่ฮ่องสอน", "YST": "ยโสธร",
    "YLA": "ยะลา", "RET": "ร้อยเอ็ด", "RNG": "ระนอง", "RYG": "ระยอง", "RBR": "ราชบุรี",
    "LRI": "ลพบุรี", "LPG": "ลำปาง", "LPN": "ลำพูน", "LEI": "เลย", "SSK": "ศรีสะเกษ",
    "SNK": "สกลนคร", "SKA": "สงขลา", "STN": "สตูล", "SPK": "สมุทรปราการ", "SKM": "สมุทรสงคราม",
    "SKN": "สมุทรสาคร", "SKW": "สระแก้ว", "SRI": "สระบุรี", "SBR": "สิงห์บุรี", "STI": "สุโขทัย",
    "SPB": "สุพรรณบุรี", "SNI": "สุราษฎร์ธานี", "SRN": "สุรินทร์", "NKI": "หนองคาย", "NBP": "หนองบัวลำภู",
    "ATG": "อ่างทอง", "ACR": "อำนาจเจริญ", "UDN": "อุดรธานี", "UTT": "อุตรดิตถ์", "UTI": "อุทัยธานี",
    "UBN": "อุบลราชธานี", "BKK": "กรุงเทพมหานคร"
}

label_dict.update(province_map)

province_to_iso = {
    "กรุงเทพมหานคร": "TH-10",
    "สมุทรปราการ": "TH-11",
    "นนทบุรี": "TH-12",
    "ปทุมธานี": "TH-13",
    "พระนครศรีอยุธยา": "TH-14",
    "อ่างทอง": "TH-15",
    "ลพบุรี": "TH-16",
    "สิงห์บุรี": "TH-17",
    "ชัยนาท": "TH-18",
    "สระบุรี": "TH-19",
    "ชลบุรี": "TH-20",
    "ระยอง": "TH-21",
    "จันทบุรี": "TH-22",
    "ตราด": "TH-23",
    "ฉะเชิงเทรา": "TH-24",
    "ปราจีนบุรี": "TH-25",
    "นครนายก": "TH-26",
    "สระแก้ว": "TH-27",
    
    "นครราชสีมา": "TH-30",
    "บุรีรัมย์": "TH-31",
    "สุรินทร์": "TH-32",
    "ศรีสะเกษ": "TH-33",
    "อุบลราชธานี": "TH-34",
    "ยโสธร": "TH-35",
    "ชัยภูมิ": "TH-36",
    "อำนาจเจริญ": "TH-37",
    "บึงกาฬ": "TH-38",
    "หนองบัวลำภู": "TH-39",
    "ขอนแก่น": "TH-40",
    "อุดรธานี": "TH-41",
    "เลย": "TH-42",
    "หนองคาย": "TH-43",
    "มหาสารคาม": "TH-44",
    "ร้อยเอ็ด": "TH-45",
    "กาฬสินธุ์": "TH-46",
    "สกลนคร": "TH-47",
    "นครพนม": "TH-48",
    "มุกดาหาร": "TH-49",

    "เชียงใหม่": "TH-50",
    "ลำพูน": "TH-51",
    "ลำปาง": "TH-52",
    "อุตรดิตถ์": "TH-53",
    "แพร่": "TH-54",
    "น่าน": "TH-55",
    "พะเยา": "TH-56",
    "เชียงราย": "TH-57",
    "แม่ฮ่องสอน": "TH-58",

    "นครสวรรค์": "TH-60",
    "อุทัยธานี": "TH-61",
    "กำแพงเพชร": "TH-62",
    "ตาก": "TH-63",
    "สุโขทัย": "TH-64",
    "พิษณุโลก": "TH-65",
    "พิจิตร": "TH-66",
    "เพชรบูรณ์": "TH-67",

    "ราชบุรี": "TH-70",
    "กาญจนบุรี": "TH-71",
    "สุพรรณบุรี": "TH-72",
    "นครปฐม": "TH-73",
    "สมุทรสาคร": "TH-74",
    "สมุทรสงคราม": "TH-75",
    "เพชรบุรี": "TH-76",
    "ประจวบคีรีขันธ์": "TH-77",

    "นครศรีธรรมราช": "TH-80",
    "กระบี่": "TH-81",
    "พังงา": "TH-82",
    "ภูเก็ต": "TH-83",
    "สุราษฎร์ธานี": "TH-84",
    "ระนอง": "TH-85",
    "ชุมพร": "TH-86",

    "สงขลา": "TH-90",
    "สตูล": "TH-91",
    "ตรัง": "TH-92",
    "พัทลุง": "TH-93",
    "ปัตตานี": "TH-94",
    "ยะลา": "TH-95",
    "นราธิวาส": "TH-96",
}

# print("Final label_dict:", label_dict)